Белгипрозем_2017/src/Catalogs/РазделыНоменклатурыДел/РазделыНоменклатурыДел.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазделыНоменклатурыДел</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/РазделыНоменклатурыДел/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает строку, содержащую перечисление полей доступа через запятую
// Это перечисление используется в дальнейшем для передачи в метод 
// ОбщегоНазначения.ПолучитьЗначенияРеквизитов()
Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат "Организация";
	
КонецФункции

// Заполняет переданный дескриптор доступа 
Процедура ЗаполнитьДескрипторДоступа(ОбъектДоступа, ДескрипторДоступа) Экспорт
	
	ДескрипторДоступа.Организация = ОбъектДоступа.Организация;
	
КонецПроцедуры

Функция ПолучитьСтруктуруРазделаНоменклатурыДел() Экспорт 
	
	ПараметрыРазделаНоменклатурыДел = Новый Структура;
	ПараметрыРазделаНоменклатурыДел.Вставить("Год");
	ПараметрыРазделаНоменклатурыДел.Вставить("Индекс");
	ПараметрыРазделаНоменклатурыДел.Вставить("Наименование");
	ПараметрыРазделаНоменклатурыДел.Вставить("Родитель");
	ПараметрыРазделаНоменклатурыДел.Вставить("Подразделение");
	ПараметрыРазделаНоменклатурыДел.Вставить("Организация");
	
	Возврат ПараметрыРазделаНоменклатурыДел;
	
КонецФункции	

Функция СоздатьРазделНоменклатурыДел(СтруктураРазделаНоменклатурыДел) Экспорт 
	
	НовыйРазделНД = Справочники.РазделыНоменклатурыДел.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйРазделНД, СтруктураРазделаНоменклатурыДел);
	НовыйРазделНД.Записать();
	
	Возврат НовыйРазделНД.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
